package task_3;

public class Task_3 {
    public static void main(String[] args) {
// 1.       Опишите своими словами, как вы поняли что такое синхронизация потоков в JAVA,
//        а также, что узнали об операторе Synchronised
   /*
    Синхронизация потоков - это координация (определение порядка доступа) потоков
       при одновременном их обращении к одному и тому же объекту.
    Оператор synchronised блокирует доступ к объекту, находящемуся в качестве монитора
      до его освобождения (пока поток, который его заблокировал, не отработает
      синхронизированную часть своего кода)
      synchronised также может быть модификатором метода, в котором заключен сихронизированный код

    */
    }
}
